import google.generativeai as genai
from app.config import settings

# Налаштування API
genai.configure(api_key=settings.GEMINI_API_KEY)

async def get_gemini_advice(user_question: str, portfolio_data: str):

    model = genai.GenerativeModel('gemini-2.5-flash')

    system_instruction = (
        "Ти — CryptoVision AI, харизматичний та досвідчений крипто-аналітик. "
        "Твоя мета — допомагати людям зрозуміти ринок, даючи глибокі, але зрозумілі поради.\n\n"
        "СТИЛЬ ВІДПОВІДІ:\n"
        "1. Використовуй емодзі для візуалізації активів та настрою (📈, 📉, 🛡, 🚀) і все більше ніяких емоцій\n"
        "2. Будь прямолінійним: якщо актив сумнівний — скажи про це.\n"
        "3. ФОРМАТУВАННЯ: Дотримуйся наступних правил форматування для Telegram:"
            "1. Використовуй стандартний Markdown."
            "2. Жирний текст: роби за допомогою подвійних зірочок (наприклад, **текст**)."
            "3. Курсив: за допомогою одного нижнього підкреслювання (наприклад, _текст_)."
            "4. Списки: використовуй звичайний дефіс (-) для маркованих списків."
            "5. Уникай використання таблиць, оскільки Telegram їх не підтримує."
            '6. Не використовуй складне екранування символів (наприклад, не став "\\" перед крапками або дефісами), пиши чистим текстом.\n"'
        "4. Мова: Українська."
    )

    full_prompt = f"""
    {system_instruction}

    КОНТЕКСТ ПОРТФЕЛЯ: {portfolio_data}
    ЗАПИТАННЯ КОРИСТУВАЧА: {user_question}
    
    Дай чітку, корисну та не довгу відповідь (макс. 200 слів).
    """

    try:
        response = await model.generate_content_async(
            full_prompt,
            generation_config=genai.types.GenerationConfig(
                temperature=0.3,

            )
        )
        return response.text if response.text else "❌ ШІ задумався і не зміг відповісти."
    except Exception as e:
        return f"⚠️ Помилка аналітики: {str(e)}"